Autodesk.Revit.DB.ElementClassFilter.#ctor(System.Type,System.Boolean)
Constructs a new instance of a filter to match elements by class, with the option to match all elements which are not of the given class.
type:
The type to match.
inverted:
True if the filter should match all elements which are not of the given class.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input type is not a subclass of Element.
-or-
The input type is of an element class that exists in the API, but not in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ElementClassFilter.#ctor(System.Type)
Constructs a new instance of a filter to match elements by class.
type:
The type to match.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input type is not a subclass of Element.
-or-
The input type is of an element class that exists in the API, but not in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011